//view title
loginViewTitle="用户登录";
fregisterViewTitle="手机注册";
userRegisterViewTitle="一键注册";

//btn title
forgetPWTitle="忘记账号/密码";
loginBtnTitle="进入游戏";
guestLoginBtn="一键注册 ";
fastRegisterBtn="手机注册";
registerBtnTitle="完成注册";
userRegisterBtn=" 手机注册";
autoRegisterBtn="试玩";
backToLoginBtn=" 返回登录";
getCodeBtn="获取验证码";
r_userNamePholder="账号(6-20位，数字、字母组成)";
swithUserBtnTitle="切换账号";

confirmBtnTitle="确定";
cancelBtnTitle="取消";
//alertView message
newVersionMessage="游戏有新版本更新，是否马上进行更新";
usernameAndPasswordNotNull="用户名或者密码不能为空";
userAndPasswordNotCorrect="用户名或者密码格式不正确";
phoneNotNull="手机号码不能为空";
phoneFormatNotCorrect="手机号码格式不正确";
passwordNotNull="密码不能为空";
passwordFormatNotCorrect="密码格式不正确";
networkError="网络请求失败";
sendcodeNotNull="请输入验证码";
PFailed="支付失败！";
Successed="支付成功！";
//ERROR
requestDataJsonDecodeError="返回数据错误";
requestDataSignError="签名验证失败";
//textfield
userNamePholder="请输入手机号/用户名";
passwordPholder="密码(6-20位)";
phonePholder="请输入手机号码";
smsPholder="请输入验证码";
inviteCodePholder="请输入激活码";

//label
welcomeLabel="欢迎回来";
loginLabel="正在登录";

passwordSample = "亲，密码过于简单，请重新输入";
passwordHaveSame = "亲，密码重复过多，请重新输入";
userNameNotPhone = "账号是由字母或数字组成";



